app/views/pessoas/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select :pessoa_estado, Estado.order(:nome), :nome, :nome, include_blank: true %>
---
SELECT "estados".* FROM "estados" ORDER BY "estados"."nome" ASC